---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConstructionType
source: html/5f6be035-3a2d-77ad-8402-4d6b87dec818.htm
---
# Autodesk.Revit.DB.Analysis.ConstructionType

This enumeration specifies the available analytical construction types
 like external walls, windows etc. for use in the detailed analytical
 energy model.

## Syntax (C#)
```csharp
public enum ConstructionType
```